app/views/mixes/new.html.erb

SELECT "genres".* FROM "genres"
---
  Select a
  <%= f.collection_select :genre_id, Genre.all, :id, :genre_name, :prompt => "Genre:" %><br>