app/controllers/genres_controller.rb

INSERT INTO "genres" ("genre_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["genre_name", "Techno"], ["created_at", 2017-03-27 16:35:39 UTC], ["updated_at", 2017-03-27 16:35:39 UTC]]
---
  def create
    @genre = Genre.new(genre_params)
    if @genre.save