app/controllers/mixes_controller.rb

  def api_index
    @mixes = Mix.all
---
SELECT "mixes".* FROM "mixes"

  def api_show
    @mix = Mix.find(params[:id])
---
SELECT  "mixes".* FROM "mixes" WHERE "mixes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @mix = Mix.new(mix_params)
    if @mix.save
---
INSERT INTO "mixes" ("mix_title", "dj_id", "genre_id", "mix_mp3_file_name", "mix_mp3_content_type", "mix_mp3_file_size", "mix_mp3_updated_at", "mix_image_file_name", "mix_image_content_type", "mix_image_file_size", "mix_image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @mix = Mix.find(params[:id])
---
SELECT  "mixes".* FROM "mixes" WHERE "mixes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]